---
kind: type
id: T:Autodesk.Revit.DB.ViewSection
zh: 剖面视图、剖面
source: html/fcc75682-bd99-a97d-5a4d-0f8eb9e92ab5.htm
---
# Autodesk.Revit.DB.ViewSection

**中文**: 剖面视图、剖面

ViewSection covers sections, details, elevations, and callouts, all in their reference and non-reference variations.

## Syntax (C#)
```csharp
public class ViewSection : View
```

## Remarks
The creation functions for elevations can be found in the ElevationMarker class.